Задача: 
 Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.

Алгоритм:

int[] arr = {1, 5, 4, 3, 2, 6, 7, 1, 1}; // задаем первоначальный массив

void PrintArray(int [] array) // метод, в качестве аргумента массив
{
    int count = 3; // задаем счетчик, сколько элементов массива мы хотим получить на выходе
    for (int i = 0; i < count; i++) // пробегаем по всем элементам массива, до заданной длинны
    {
System.Console.Write($"{array[i]} ");
    }
    System.Console.WriteLine();
}

PrintArray(arr); // выводим массив нужной нам длинны